- [Data School's top 25 pandas tricks](https://nbviewer.org/github/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb)
- [Data School: 21 more pandas tricks](https://github.com/justmarkham/pandas-videos/blob/master/21_more_pandas_tricks.ipynb)

In [1]:
import pandas as pd
import numpy as np

In [2]:
#movies = pd.read_csv('http://bit.ly/imdbratings')
#orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
#orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
#stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
#titanic = pd.read_csv('http://bit.ly/kaggletrain')
#ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

# 1. Show installed versions

In [3]:
pd.__version__

'1.4.2'

# 1.1 show dependencies as well

In [4]:
#pd.show_versions()

# 2. Create an example DataFrame

In [5]:
df = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [6]:
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.511559,0.498995,0.358746,0.793103,0.468181,0.630955,0.640138,0.468305
1,0.047041,0.169426,0.608441,0.913540,0.260368,0.032603,0.821756,0.092201
2,0.222907,0.450307,0.818735,0.922094,0.712526,0.757006,0.461970,0.701276
3,0.925314,0.866981,0.053895,0.640840,0.693263,0.274233,0.165584,0.475497

In [7]:
pd.DataFrame(np.random.rand(4, 8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.725528,0.462886,0.386128,0.408724,0.826330,0.863443,0.114111,0.878696
1,0.037573,0.166565,0.430047,0.424826,0.631714,0.129951,0.471000,0.305805
2,0.624071,0.865312,0.096572,0.614371,0.456997,0.079219,0.557907,0.125521
3,0.802099,0.690657,0.210704,0.654171,0.953933,0.206666,0.850215,0.748346

# 3. Rename columns
- `rename()`: You pass it a dictionary in which the keys are the old names and the values are the new names, and you also specify the axis:

In [8]:
df = df.rename({'col one':'col_1', 'col two':'col_2'}, axis='columns')
df

   col_1  col_2
0    100    300
1    200    400

- if you're going to rename **all** of the columns at once, a simpler method is just to overwrite the columns attribute of the DataFrame

In [9]:
df.columns = ['col_one', 'col_two']
df
df.columns = df.columns.str.replace('_', '-')
df
df = df.add_prefix('Oo_')
df
df = df.add_suffix('_oO')
df

   Oo_col-one_oO  Oo_col-two_oO
0            100            300
1            200            400

# 4. Reverse row order¶

In [10]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [11]:
drinks.loc[::-1].head() #Note this is reverse "row" order!

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

- What if you also wanted to reset the index so that it starts at zero?
  - You would use the reset_index() method and tell it to drop the old index entirely:

In [12]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

In [13]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

# 5. Reverse column order

In [14]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

# 6. Select columns by data type

In [15]:
drinks.dtypes
drinks.select_dtypes(include='number').head() # This includes both int and float columns.

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [16]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [17]:
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [18]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

# 7. Convert strings to numbers

In [21]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [23]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [24]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [25]:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [26]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [27]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0